Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisVolumes Property
 The analysis volumes of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisVolume> AnalysisVolumes { get; }
Public ReadOnly Property AnalysisVolumes As List(Of AnalysisVolume)
	Get
Property Value
Type: List<AnalysisVolume>
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace